In [6]:
import numpy as np
import pandas as pd
from scipy import stats

In [2]:
bp = pd.read_csv(r'./blood_pressure.csv')

In [5]:
bp.head()

       before       after
0  136.713072   92.432965
1  134.735618  105.022643
2  127.529115   82.242766
3  144.527126   93.607172
4  124.214720  103.212223

In [7]:
stats.ttest_rel(bp['before'], bp['after'])

Ttest_relResult(statistic=27.29184176756024, pvalue=7.303035069607835e-48)

In [10]:
stats.ttest_1samp(bp['after']-bp['before'], 0)

Ttest_1sampResult(statistic=-27.29184176756024, pvalue=7.303035069607835e-48)

In [11]:
ab = pd.read_csv(r'./ab_test.csv')

In [12]:
ab.head()

       a      b
0   0.27  13.61
1   6.08  21.53
2  13.74   9.23
3   9.70   5.36
4   7.00  12.90

In [13]:
stats.ttest_ind(ab['a'], ab['b'])

Ttest_indResult(statistic=-2.637533181209767, pvalue=0.009713140852447347)

In [28]:
rate = pd.read_csv(r'./rate_by_city.csv')
rate.head()

    Rate  City
0  13.75     1
1  13.75     1
2  13.50     1
3  13.50     1
4  13.00     1

In [16]:
rate['city_count'] = rate.groupby(by='City').cumcount()

In [25]:
rate_pivot = rate.pivot(index='city_count', columns='City', values='Rate')

In [26]:
rate_pivot

City            1      2      3      4      5      6
city_count
0           13.75  14.25  14.00  15.00  14.50  13.50
1           13.75  13.00  14.00  14.00  14.00  12.25
2           13.50  12.75  13.51  13.75  14.00  12.25
3           13.50  12.50  13.50  13.59  13.90  12.00
4           13.00  12.50  13.50  13.25  13.75  12.00
5           13.00  12.40  13.25  12.97  13.25  12.00
6           13.00  12.30  13.00  12.50  13.00  12.00
7           12.75  11.90  12.50  12.25  12.50  11.90
8           12.50  11.90  12.50  11.89  12.45  11.90

In [27]:
rate_pivot.columns = ['City_' + str(x) for x in rate_pivot.columns.values]
rate_pivot

            City_1  City_2  City_3  City_4  City_5  City_6
city_count
0            13.75   14.25   14.00   15.00   14.50   13.50
1            13.75   13.00   14.00   14.00   14.00   12.25
2            13.50   12.75   13.51   13.75   14.00   12.25
3            13.50   12.50   13.50   13.59   13.90   12.00
4            13.00   12.50   13.50   13.25   13.75   12.00
5            13.00   12.40   13.25   12.97   13.25   12.00
6            13.00   12.30   13.00   12.50   13.00   12.00
7            12.75   11.90   12.50   12.25   12.50   11.90
8            12.50   11.90   12.50   11.89   12.45   11.90

In [30]:
stats.f_oneway(rate_pivot.City_1, rate_pivot.City_2, rate_pivot.City_3, rate_pivot.City_4, rate_pivot.City_5, rate_pivot.City_6)

F_onewayResult(statistic=4.8293848737024, pvalue=0.001174551414504048)

In [ ]:
s